from operator import itemgetter

list_test_target = []
list_test_unique = []

list_test_add = [['광교지웰홈스', '84.7', '4억 5,000', '4억 5,000', '  6/8', '즉시입주가능 I 남향 I 조용한동 I 버스정류장 앞동'], ['광교지웰홈스', '84.7', '4억 5,000', '4억 5,000', '  5/8', '날짜조율가능 I 정상입주가능 I 채광굿 I 집상태깔끔 I 버스정류장앞'], ['광교지웰홈스', '84.7', '5억      ', '5억      ', '  8/8', '신대호수 보이는 정남향.ROOM3과 다락방,테라스,상현역 도보,융무,'], ['광교지웰홈스', '84.8', '5억      ', '5억      ', ' 중/8', '최고초록뷰 I 안방,세탁실 넓은 타입 I 5월이후 입주 I'], ['광교지웰홈스', '84.7', '5억 3,000', '5억 3,000', '  7/8', '전망좋은집,방3,화2,상현역인근'], ['광교지웰홈스', '84.8', '5억 3,000', '5억 3,000', ' 고/8', '위치좋음,신혼부부추천'], ['광교지웰홈스', '84.8', '5억 5,000', '5억 5,000', '  7/8', '전망좋음 축구장뷰 안방넓은타입 날짜협의'], ['광교지웰홈스', '84.8', '5억 5,000', '5억 5,000', '  2/8', '날짜협의가능 방3화2 안방넓음 주인거주'], ['광교지웰홈스', '84.8', '6억      ', '6억      ', '  8/8', '복층테라스, 넓은다락방, 레스피아축구장조망, 탁트인뷰, 상현역이용편리'], ['힐스테이트광교', '53.7', '4억 8,000', '4억 8,000', ' 6/18', '2룸의 인기판상형, 예쁜호수뷰 좋아요.'], ['힐스테이트광교', '53.7', '4억 8,000', '4억 8,000', '저/18', '막힘없는 호수공원뷰 풀옵션 투룸  욕실2개 신혼부부 강추'], ['힐스테이트광교', '53.7', '4억 9,000', '4억 9,000', '18/19', '환상적인 호수뷰와 2룸의 예쁜 판상형구조.'], ['힐스테이트광교', '53.7', '5억 2,000', '4억 8,000', '12/19', '예쁜 호수뷰와 채광과 환기가 좋은 2룸 판상형.'], ['힐스테이트광교', '53.7', '5억 2,000', '5억 2,000', '중/19', '8월초입주가능,풀옵션투룸,막힘없는호수조망'], ['힐스테이트광교', '77.5', '8억      ', '8억      ', ' 3/19', '빠른입주 가능, 테라스 타입, 호수조망'], ['힐스테이트광교', '77.5', '8억      ', '8억      ', ' 2/19', '넘 예쁜 이국적인 호수뷰,힐링 테라스,귀한 매물.'], ['에듀하임1309', '46.9', '3억 7,000', '3억 7,000', '중/15', '2룸 로얄동 저렴한 전세 융자무 추천매물'], ['에듀하임1309', '46.9', '3억 7,000', '3억 7,000', '고/15', '역세권,잘관리된집,신혼강추,'], ['에듀하임1309', '46.9', '3억 7,000', '3억 7,000', '저/15', '즉시 입주가능, 혜령공원 조망, 밝고 깨끗함. 역세권,각종커뮤니시설'], ['에듀하임1309', '46.9', '3억 8,000', '3억 8,000', '저/15', '빠른입주 조정가능 3층높이 1층 숨은공간확장 집상태 최상'], ['에듀하임1309', '46.9', '3억 8,000', '3억 8,000', '저/15', '주거용2룸  전세'], ['에듀하임1309', '46.9', '3억 9,000', '3억 9,000', '중/15', '역세권,관리잘된깨끗한집,신혼강추,'], ['에듀하임1309', '46.9', '3억 9,000', '3억 9,000', '저/15', '중층의 선호타입의 투룸 전세(4월8일 입주가능)'], ['에듀하임1309', '46.9', '3억 9,000', '3억 9,000', ' 2/15', '빠른입주,B타입,역세권'], ['에듀하임1309', '46.9', '4억      ', '4억      ', '고/15', '단지뷰 동향, 중층. 보증금 조정 가.'], ['에듀하임1309', '46.9', '4억      ', '4억      ', '중/15', 'none'], ['에듀하임1309', '46.9', '4억      ', '4억      ', '저/15', '즉시입주.인기투룸.중앙역.'], ['에듀하임1309', '46.9', '4억      ', '4억      ', '저/15', '조용한 공원뷰 투룸전세 즉시 입주가능'], ['에듀하임1309', '46.9', '4억 1,000', '4억 1,000', '고/15', '6월초입주,동향의 고층, 귀한 전세,햇살좋은집,역세권'], ['에듀하임1309', '46.9', '4억 1,000', '4억 1,000', '고/15', '5월초입주,동향의고층,채광굿,역세권'], ['에듀하임1309', '46.9', '4억 2,000', '4억 2,000', ' 7/15', '광교중앙 에듀하임 투룸 전세'], ['에듀하임1309', '62.9', '4억 3,000', '4억 3,000', '중/15', '쓰리룸 즉시입주 최저가 추천매물'], ['에듀하임1309', '62.9', '4억 3,000', '4억 3,000', '고/15', '즉시입주,거실확장형,최저가전세,역세권'], ['에듀하임1309', '62.9', '4억 3,000', '4억 3,000', '중/15', '하시입주, 저련한 전세,역세권'], ['에듀하임1309', '62.9', '4억 5,000', '4억 5,000', '저/15', '올수리,거실확장형,역세권'], ['에듀하임1309', '62.9', '4억 7,000', '4억 7,000', '저/15', '빠른입주가능한 쓰리룸 전세.상태깨끗'], ['에듀하임1309', '62.9', '4억 8,000', '4억 8,000', '저/15', '초록초록 예쁜 숲뷰.3룸'], ['에듀하임1309', '62.9', '4억 8,000', '4억 8,000', '중/15', '햇살이 잘드는 거실확장된  빠른입주 가능한 쓰리룸 전세'], ['에듀하임1309', '62.9', '4억 9,000', '4억 9,000', '14/15', '공원뷰, 광교중앙역역세권'], ['에듀하임1309', '62.9', '5억      ', '4억 5,000', ' 8/15', '경기도청.광교중악역 도보 쓰리룸5억대전세'], ['힐스테이트광교중앙역', '53.3', '4억      ', '4억      ', ' 4/20', '빠른입주가능 풀옵션 전입가능'], ['힐스테이트광교중앙역', '59.3', '4억 1,700', '4억 1,700', '중/20', '남향, 전입가능, 투룸, 초역세권'], ['힐스테이트광교중앙역', '59.4', '4억 3,000', '4억 3,000', '중/20', '전입가능 무융자 테라스겸비 집보러오세요'], ['힐스테이트광교중앙역', '59.4', '4억 3,000', '4억 3,000', '중/20', '풀옵션,광교중앙역,전입신고가능,융자無,보증보험가능'], ['힐스테이트광교중앙역', '59.4', '4억 5,000', '4억      ', ' 4/20', '무융자,빠른입주가능,새집같이 깔끔한집,착한금액,지하철이용편리 '], ['힐스테이트광교중앙역', '59.4', '4억 5,000', '4억 5,000', '고/20', '풀옵션,역세권,호수공원도보권'], ['힐스테이트광교중앙역', '59.1', '4억 6,000', '4억 6,000', '중/20', '역세권 풀옵션,트인조망,일조권 좋아요'], ['힐스테이트광교중앙역', '59.3', '4억 7,000', '4억 7,000', '고/20', '입주협의가능 융무 전세대출 햇살좋아요'], ['힐스테이트광교중앙역', '58.6', '4억 7,000', '4억 7,000', '저/20', '6월말입주,투룸에 테라스 구조,역세권,호수공원 인접,주변상업시설 편리. '], ['힐스테이트광교중앙역', '59.4', '4억 7,000', '4억 7,000', '고/20', '중심상권의 역세권 오피스텔'], ['힐스테이트광교중앙역', '59.1', '4억 7,000', '4억 7,000', '14/20', '광교중앙역5분 투룸 착한전세 입주협의'], ['힐스테이트광교중앙역', '59.4', '4억 8,000', '4억 8,000', '고/20', '광교중앙역도보7분,도청뷰,풀옵션'], ['힐스테이트광교중앙역', '59.4', '4억 9,000', '4억 9,000', '중/20', '전입가능, 풀옵션, 빠른입주 가능'], ['힐스테이트광교중앙역', '59.4', '5억      ', '4억 7,000', ' 7/20', '투룸 풀옵션 개방감있고확트인뷰'], ['힐스테이트광교중앙역', '59.1', '5억      ', '5억      ', '고/20', ' 전입가능,  하시입주가능함 막힘없는뷰'], ['힐스테이트광교중앙역', '59.2', '5억      ', '5억      ', '중/20', '풀옵션2룸,해잘드는집,2인가구강추,초초역세권'], ['힐스테이트광교중앙역', '59.4', '5억      ', '5억      ', '중/20', '풀옵션2룸,최상의 뷰,2인가구강추,초초역세권'], ['힐스테이트광교중앙역', '59.3', '5억      ', '5억      ', '중/20', '즉시입주 전입X 풀옵션 초역세권'], ['힐스테이트광교중앙역', '59.2', '5억      ', '5억      ', '중/20', '귀한 남서향 롯데아울렛 광장뷰, 투룸'], ['힐스테이트광교중앙역', '83.4', '7억 3,000', '7억 3,000', '14/20', '귀한전세.5월입주.방3개.광교도청중앙역.교통.상권.인프라최고.'], ['분당두산위브파빌리온', '41.6', '4억      ', '4억      ', '17/33', '24.깨끗,전망굿,빠른입주가능 시세보다저렴'], ['분당두산위브파빌리온', '41.6', '4억 2,000', '4억 2,000', '28/33', '24.깨끗 정상 월세3억40가능'], ['분당두산위브파빌리온', '41.6', '4억 2,000', '4억 2,000', '29/33', '24, 방1, 거실1, 전망굿, 전입, 융무'], ['분당두산위브파빌리온', '41.6', '4억 2,000', '4억 2,000', '31/33', '24 조용한 귀한물건 방분리 전입 입주협의 '], ['분당두산위브파빌리온', '52.9', '5억      ', '5억      ', '10/33', '31타입 전입가능하며 전세자금대출가능한 전세입니다 방2 화장실1구조'], ['분당두산위브파빌리온', '65.3', '6억 2,000', '6억 2,000', ' 7/33', '39.'], ['분당두산위브파빌리온', '65.3', '6억 2,000', '6억 2,000', ' 7/33', '39룸2 욕1 전입 전세자금대출 상태양호'], [' 분당두산위브파빌리온', '65.3', '6억 2,000', '6억 2,000', ' 7/33', '39 방2 넓은거실 수납많은집  전입가능 조용하고 깨끗한집'], ['분당두산위브파빌리온', '65.3', '6억 2,000', '6억 2,000', '저/33', '신혼집추천,방2개,깨끗 39타입 전입융무 전세대출가 정자환승역3분주차편리'], ['분당두산위브파빌리온', '65.3', '6억 2,000', '6억 2,000', '저/33', '신혼집추천,신규도배,넓은거실 방2개,39타입 전입융무 전세대출가 입주협의'], ['분당두산위브파빌리온', '65.3', '6억 2,000', '6억 2,000', '중/33', '전망특. 전입가. 융자무'], ['분당두산위브파빌리온', '65.3', '6억 2,000', '6억 2,000', '저/33', 'none'], ['분당두산 위브파빌리온', '65.3', '6억 5,000', '6억 5,000', '19/33', '39타입 방2  전입  수납넉넉  전세자금대출가능  신분당선3분 '], ['분당두산위브파빌리온', '65.3', '6억 5,000', '6억 5,000', '19/33', '39, 방2 욕실1, 전입, 융무, 전세대출가능'], ['분당두산위브파빌리온', '65.3', '6억 5,000', '6억 5,000', '중/33', 'o39o 방2.수납넉넉.시티뷰.역도보'], ['분당두산위브파빌리온', '70.3', '6억 7,000', '6억 7,000', ' 7/33', '42 도배 빠른입주 특깨끗'], ['분당두산위브파빌리온', '70.3', '6억 7,000', '6억 7,000', ' 7/33', '42 정남향 전망 방2 전입가능 전세자금대출 관리비저렴'], ['분당두산위브파빌리온', '70.3', '6억 7,000', '6억 7,000', ' 6/33', '42, 방2개, 전입가능, 융자무, 남향, 빠른입주가능'], ['분당두산위브파빌리온', '70.3', '6억 7,000', '6억 7,000', '저/33', 'o42o 방2.정남향.깨끗.역학원.도보'], ['분당두산위브파빌리온', '70.3', '6억 7,000', '6억 7,000', '저/33', 'none'], ['분당두산위브파빌리온', '75.4', '7억      ', '7억      ', '중/33', '정상 깨끗 융무'], ['분당두산위브파빌리온', '75.4', '7억      ', '7억      ', '30/33', '44타입의 고층 전세입니다 방2 화장실1구조의 넓은 안방'], ['성호샤인힐즈', '84.9', '4억      ', '4억      ', ' 3/10', '남향집, 사통팔달, 깨끗, 입주일 조정가능'], ['성호샤인힐 즈', '84.9', '4억      ', '4억      ', ' 9/10', '전망최고   빠른입주가능 융무'], ['성호샤인힐즈', '84.9', '4억      ', '4억      ', ' 9/10', '즉시입주가능, 층간소음걱정없음'], ['성호샤인힐즈', '84.9', '4억 7,000', '4억 7,000', ' 7/10', '전망뻥뚫린 완전깨끗한집 9월20일부터 10월10일사이 협의가능'], ['광교SK뷰레이크타워', '84.4', '8억      ', '8억      ', '저/41', '예쁜호수뷰  햇살좋은남향  즉시입주가능'], ['광교SK뷰레이크타워', '84.9', '8억 3,000', '8억 3,000', ' 6/41', '3월말입주가능.남향전세.호수뷰.컨디션좋음.'], ['광교SK뷰레이크타워', '84.4', '8억 5,000', '8억 5,000', '중/41', '호수조망굿,이사협의'], ['중흥S-클래스', '84.2', '6억      ', '6억      ', ' 2/27', '아이들키우기좋은 필로티층,학교가까운동,호수생활권'], ['중흥S-클래스', '84.2', '7억      ', '7억      ', '20/27', '깔끔,빠른이사O,호수뷰'], ['중흥S-클래스', '74.9', '7억      ', '7억      ', '고/10', '무융자전세,빠른입주가능,백화점,중앙역이용편리한동'], ['중흥S-클래스', '84.2', '7억 5,000', '7억 5,000', ' 8/27', '호수뷰, 즉시입주가능, 귀한전세 '], ['중흥S-클래스', '84.5', '7억 5,000', '7억 5,000', '고/27', '입주협의가능 방3 아파텔 조망 예쁜집 최고 인프라 '], ['중흥S-클래스', '84.9', '7억 5,000', '7억 5,000', '중/27', 'BEST,환상호수뷰ㅣ로열층ㅣ즉시입주가능ㅣ날짜다맞춰드려요ㅣ집바로보여드림'], ['중흥S-클래스', '84.9', '7억 8,000', '7억 8,000', '중/27', '호수뷰와 숲뷰,거실이면창이라 개방감 좋아요,빠른입주가능'], ['중흥S-클래스', '84.9', '8억      ', '8억      ', '고/27', '전입신고가능,채광굿,전세자금가능,입 주협의가능,광교호수공원뷰'], ['포레나광교', '84.6', '7억 5,000', '7억 5,000', '39/45', 'D타입,맞통풍,호수뷰,너무예쁜집,풀옵션'], ['포레나광교', '84.5', '8억      ', '8억      ', '고/47', '보증금,입주일협의,환상호수뷰, 인기판상형 C타입, 햇빛잘들고 밝은집'], ['포레나광교', '84.6', '8억      ', '8억      ', '저/47', '최고로얄층.광교호수뷰중1등.슬리퍼신고백화점.영화관.아쿠아리움.컨벤션행사'], ['포레나광교', '84.5', '8억 3,000', '8억 3,000', '저/45', 'C 전입가능 7월입주 냉장고 김냉옵션'], ['포레나광교', '84.4', '8억 3,000', '8억 3,000', '저/45', '조절가,빠른입주'], ['포레나광교', '84.6', '8억 5,000', '8억 5,000', '36/45', 'BESTl즉시입주가능ㅣ방확장형ㅣ조정가능ㅣ헤링본마루ㅣ호수뷰ㅣ로열동,로열층'], ['포레나광교', '84.6', '8억 5,000', '8억 5,000', '14/45', '84A  최고의 호수뷰    즉시입주  식탁옵션  23년10월만기조건'], ['포레나광교', '84.6', '9억      ', '9억      ', '중/42', '공실, 호 수뷰, 전입가능'], ['포레나광교', '84.5', '9억 5,000', '9억 5,000', '고/47', '정남향, 고층 멋진 호수뷰,'], ['포레나광교', '84.4', '11억     ', '11억     ', '고/47', '첫입주, 전입o, 고층 호수뷰, 갤러리아, 광교중앙역, 단기 월세 가능']]

# s = sorted(list_test_add, key=itemgetter(3))
# for i in s:
#     print(i)

def get_unique_test(): #--> new function to get min
    s = sorted(list_test_add, key=itemgetter(3))
    l1 = []
    for i in s:
        l1.append([hash(i[0]), hash(i[1])])
        # l1.append(hash(i[0])+hash(i[1]))
    sorted_set = set(l1)
    print(sorted_set)
    # for i in sorted_set:
    #     list_test_unique.append([s[l1.index(i)][0], s[l1.index(i)][1], s[l1.index(i)][3]])
# def get_unique_test(): #--> new function to get min
#     s = sorted(list_test_add, key=itemgetter(3))
#     l1 = []
#     for i in s:
#         l1.append(hash(i[0])+hash(i[1]))
#     set1 = set(l1)
#     l2 = []
#     for i in l1:
#         print(l1.index(i))
#         l2.append(l1[l1.index(i)])
#     for i in l2:
#         list_test_unique.append([s[l1.index(i)][0], s[l1.index(i)][1], s[l1.index(i)][3]])

get_unique_test()
# for i in list_test_unique:
#     print(i)


# list_test_target.clear()
# s = sorted(list, key=itemgetter(3))
# for i in s:
#     try:
#         if i[3].find("억") == 1:
#             prc = int('{:.1}{:.1}{}'.format(i[3].split()[0], i[3].split()[1], i[3].split(",")[1]))
#         else:
#             prc = int('{:.2}{:.1}{}'.format(i[3].split()[0], i[3].split()[1], i[3].split(",")[1]))
#     except:
#         if i[3].find("억") == 1:
#             prc = int('{:.1}0000'.format(i[3].split()[0]))
#         else:
#             prc = int('{:.2}0000'.format(i[3].split()[0]))
#     if prc <= 40000:
#         list_test_target.append(i)

# print(list_test_target)


# for i in range(8):
#     x = random.uniform(2, 6)
#     time.sleep(x)
#     print(i, f"delayed for: {x} seconds")

# def myPeriodicFunction():
#     print "This loops on a timer every %d seconds" % interval

# def startTimer():
#     threading.Timer(interval, startTimer).start()
#     myPeriodicFunction()


# import requests
# import json

# url = "https://kapi.kakao.com/v1/api/talk/friends"

# KAKAO_TOKEN = 'YmJbNK5eu1fEl8KHpPBTrKwocvHgrL9AaqkQ1wo9dJkAAAF_-h7YOA'

# header = {"Authorization": "Bearer " + KAKAO_TOKEN}

# r = requests.get(url, headers=header).text
# print(r)

# list = [['84.7', '4억 5,000', '광교지웰홈스'], ['84.8', '5억      ', '광교지웰홈스'], ['53.7', '4억 8,000', '힐스테이트광교'], ['77.5', '8억      ', '힐스테이트광교'], ['46.9', '3억 7,000', '에듀하임1309'], ['62.9', '4억 3,000', '에듀하임1309'], ['53.3', '4억      ', '힐스테이트광교중앙역'], ['58.6', '4억 7,000', '힐스테이트광교중앙역'], ['59.1', '4억 6,000', '힐스테이트광교중앙역'], ['59.2', '5억      ', '힐스테이트광교중앙역'], ['59.3', '4억 1,700', '힐스테이트광교중앙역'], ['59.4', '4억      ', '힐스테이트광교중앙역'], ['83.4', '7억 3,000', '힐스테이트광교중앙역']]
# list2 = []
# # for i in list:
# #     try:
# #         print('{:.1}{:.1}{}'.format(i[1].split()[d0], i[1].split()[1], i[1].split(",")[1]))
# #     except:
# #         print('{:.1}0000'.format(i[1].split()[0]))

# # for i in list:
# #     try:
# #         prc = int('{:.1}{:.1}{}'.format(i[1].split()[0], i[1].split()[1], i[1].split(",")[1]))
# #     except:
# #         prc = int('{:.1}0000'.format(i[1].split()[0]))
# #     if prc < 42000:
# #         print('\n')
# #         print(prc)

# for i in list:
#     try:
#         prc = int('{:.1}{:.1}{}'.format(i[1].split()[0], i[1].split()[1], i[1].split(",")[1]))
#     except:
#         prc = int('{:.1}0000'.format(i[1].split()[0]))
#     if prc < 42000:
#         list2.append(i)

# x = ''
# for i in range(len(list2)):
#     x += list2[i][0] + " " + list2[i][1] + " " + list2[i][2] + "\n"
# print(x)
#         # if i == 0:
#         #     x += list[i] + "\n"
#         #     x += list2[i][0] + " " + list2[i][1] + "\n"
#         # else:
#         #     x += list2[i][0] + " " + list2[i][1] + "\n"
